cask_args appdir: "/Applications"

# Tap
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"

# Cask
cask "visual-studio-code"
cask "jetbrains-toolbox"
cask "docker"
cask "google-chrome"
cask "firefox"
cask "brave-browser"
cask "dropbox"
cask "postman"
cask "notion"
cask "obsidian"
cask "skype"
cask "zoom"
cask "slack"
cask "discord"
cask "quicklook-json"
cask "qlmarkdown"
cask "libreoffice"
cask "maccy"

# Dev
brew "tree"
brew "python"
brew "pyenv"
brew "pyenv-virtualenv"
brew "rust"
brew "golang"
brew "protobuf"
brew "postgresql"
brew "pgcli"
brew "lua"

# Command-Line tools 
brew "jq"

# Window manager
brew "koekeishiya/formulae/yabai"
brew "koekeishiya/formulae/skhd"
