cask_args appdir: "/Applications"

# Tap
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "adoptopenjdk/openjdk"

# Cask
cask "java"
cask "adoptopenjdk8"
cask "adoptopenjdk11"
cask "visual-studio-code"
cask "jetbrains-toolbox"
cask "atom"
cask "docker"
cask "google-chrome"
cask "firefox"
cask "brave-browser"
cask "dropbox"
cask "postman"
cask "notion"
cask "skype"
cask "zoom"
cask "slack"
cask "discord"
cask "quicklook-json"
cask "qlmarkdown"

# Dev
brew "tree"
brew "python"
brew "openjdk"
brew "scala"
brew "mit-scheme"
brew "rust"
brew "postgresql"
brew "pgcli"
brew "protobuf"

# Command-Line tools 
brew "jq"