adpyke.vscode-sql-formatter
alefragnani.project-manager
alexcvzz.vscode-sqlite
arcticicestudio.nord-visual-studio-code
batisteo.vscode-django
bierner.markdown-checkbox
bierner.markdown-preview-github-styles
buster.ndjson-colorizer
codezombiech.gitignore
compulim.vscode-chinese-translation
csstools.postcss
dae.vscode-mac-color-picker
darkriszty.markdown-table-prettify
davidanson.vscode-markdownlint
dbaeumer.vscode-eslint
dsznajder.es7-react-js-snippets
eamodio.gitlens
ecmel.vscode-html-css
editorconfig.editorconfig
enkia.tokyo-night
equinusocio.vsc-community-material-theme
equinusocio.vsc-material-theme
equinusocio.vsc-material-theme-icons
esbenp.prettier-vscode
evzen-wybitul.magic-racket
fcrespo82.markdown-table-formatter
foam.foam-vscode
formulahendry.auto-rename-tag
formulahendry.code-runner
github.github-vscode-theme
golang.go
gruntfuggly.todo-tree
humao.rest-client
jasonnutter.search-node-modules
jeffersonlicet.snipped
jock.svg
leetcode.vscode-leetcode
leizongmin.node-module-intellisense
mechatroner.rainbow-csv
mgmcdermott.vscode-language-babel
mhutchie.git-graph
ms-azuretools.vscode-docker
ms-python.black-formatter
ms-python.debugpy
ms-python.flake8
ms-python.isort
ms-python.mypy-type-checker
ms-python.pylint
ms-python.python
ms-python.vscode-pylance
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow
ms-vscode-remote.remote-containers
ms-vscode.atom-keybindings
ms-vscode.makefile-tools
ms-vsliveshare.vsliveshare
mushan.vscode-paste-image
naumovs.color-highlight
ngryman.codesandbox-theme
orta.vscode-twoslash-queries
pkief.material-icon-theme
plex.vscode-protolint
pranaygp.vscode-css-peek
ransh.ransh
redhat.java
redhat.vscode-yaml
rexebin.dracula
ritwickdey.liveserver
robocorp.robotframework-lsp
rokoroku.vscode-theme-darcula
roscop.activefileinstatusbar
ryanolsonx.solarized
sdras.night-owl
shd101wyy.markdown-preview-enhanced
silvenga.edi-x12-support
sjhuangx.vscode-scheme
streetsidesoftware.code-spell-checker
stylelint.vscode-stylelint
sujan.code-blue
tomoki1207.pdf
tomphilbin.gruvbox-themes
unifiedjs.vscode-mdx
vincaslt.highlight-matching-tag
vintharas.learn-vim
visualstudioexptteam.intellicode-api-usage-examples
visualstudioexptteam.vscodeintellicode
vortizhe.simple-ruby-erb
vrjuliao.sml-environment
vscjava.vscode-java-debug
vscjava.vscode-java-dependency
vscjava.vscode-java-pack
vscjava.vscode-java-test
vscjava.vscode-maven
vscodevim.vim
vue.volar
wallabyjs.quokka-vscode
yzhang.markdown-all-in-one
zhuangtongfa.material-theme
zneuray.erb-vscode-snippets
zxh404.vscode-proto3
